# -----------------------------
# Taps
# -----------------------------
tap "common-fate/granted"
tap "oven-sh/bun"

# -----------------------------
# CLI tools
# -----------------------------
brew "act"             # Run your GitHub Actions locally
brew "coreutils"       # GNU File, Shell, and Text utilities
brew "direnv"          # Load/unload environment variables based on $PWD
brew "fzf"             # Command-line fuzzy finder
brew "gnutls"          # GNU Transport Layer Security (TLS) Library
brew "gnupg"           # GNU Pretty Good Privacy (PGP) package
brew "go"              # Open source programming language
brew "helm"            # Kubernetes package manager
brew "jq"              # Lightweight command-line JSON processor
brew "mise"            # Polyglot runtime manager (asdf rust clone)
brew "neovim"          # Ambitious Vim-fork focused on extensibility
brew "nss"             # Libraries for security-enabled client/server apps
brew "openjdk"         # Development kit for Java
brew "rbenv"           # Ruby version manager
brew "ruby"            # Powerful, clean, object-oriented scripting language
brew "snyk-cli"        # Scans and monitors projects for security vulnerabilities
brew "stow"            # Organize software neatly under a single directory tree
brew "tree"            # Display directories as trees
brew "wget"            # Internet file retriever
brew "zsh"             # UNIX shell
brew "common-fate/granted/granted"  # Access cloud features (check tap path)

# -----------------------------
# GUI apps (casks)
# -----------------------------
cask "docker"
cask "iterm2"
cask "orbstack"
cask "spotify"

# -----------------------------
# VS Code extensions
# -----------------------------
vscode "bierner.markdown-preview-github-styles"
vscode "ciarant.vscode-structurizr"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "ms-vsliveshare.vsliveshare"
vscode "ritwickdey.liveserver"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-australian-english"
vscode "upstash.context7-mcp"
vscode "vitest.explorer"

# -----------------------------
# Go tools
# -----------------------------
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
